#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// ++ Вихарев А.А. 03.10.2026
	// Проверяем, не добавлено ли поле и группа ранее (чтобы избежать дублирования)
	Если (Элементы.Найти("ДК_КонтактноеЛицо") = Неопределено) И (Элементы.ГруппаШапкаПраво <> Неопределено)  Тогда
		
		// Создаём поле ввода для реквизита "ДК_КонтактныеЛица"
		ПолеДК_КонтактныеЛица = Элементы.Добавить("ДК_КонтактноеЛицо", Тип("ПолеФормы"), Элементы.ГруппаШапкаПраво);
		ПолеДК_КонтактныеЛица.Вид = ВидПоляФормы.ПолеВвода;
		ПолеДК_КонтактныеЛица.ПутьКДанным = "Объект.ДК_КонтактноеЛицо";
		ПолеДК_КонтактныеЛица.Заголовок = "Контактное лицо";
		
		// Ограничиваем выбор Контактных лиц
		МассивСвязей = Новый Массив;
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Контрагент");
		МассивСвязей.Добавить(НоваяСвязь);
		ПолеДК_КонтактныеЛица.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
		
	КонецЕсли;
	
	// Проверяем, не добавлено ли группа, поле и команда ранее (чтобы избежать дублирования)
	Если (Элементы.Найти("ДК_ГруппаСкидка") = Неопределено)
		И (Элементы.Найти("ДК_СогласованнаяСкидкаПоле") = Неопределено)
		И (Элементы.Найти("ДК_ПрименитьСкидкуКоманда") = Неопределено) Тогда
		
		// Создаём группу "ДК_ГруппаСкидка" (обычная группа)
		ДК_СкидкаГруппа = Элементы.Добавить("ДК_ГруппаСкидка", Тип("ГруппаФормы"));
		ДК_СкидкаГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ДК_СкидкаГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		ДК_СкидкаГруппа.ОтображатьЗаголовок = Ложь;
		
		// Добавляем поле для ввода скидки, помещаем внутрь созданной группы
		ДК_СогласованнаяСкидкаПоле = Элементы.Добавить("ДК_СогласованнаяСкидка", Тип("ПолеФормы"), ДК_СкидкаГруппа);
		ДК_СогласованнаяСкидкаПоле.Вид = ВидПоляФормы.ПолеВвода;
		ДК_СогласованнаяСкидкаПоле.Заголовок = "Согласованная скидка";
		ДК_СогласованнаяСкидкаПоле.ПутьКДанным = "Объект.ДК_СогласованнаяСкидка";
		Элементы.Переместить(ДК_СкидкаГруппа, ЭтаФорма,Элементы.Страницы);
		ДК_СогласованнаяСкидкаПоле.УстановитьДействие("ПриИзменении", "ДК_СкидкаПриИзменении");
		
		// Создаем команду формы ПрименитьСкидку
		ДК_ПрименитьСкидкуКоманда = Команды.Добавить("ДК_ПрименитьСкидку");
		ДК_ПрименитьСкидкуКоманда.Заголовок = "Применить скидку";
		ДК_ПрименитьСкидкуКоманда.Действие = "ДК_ПрименитьСкидку";
		ДК_ПрименитьСкидкуКоманда.Картинка = БиблиотекаКартинок.Успешно;
		ДК_ПрименитьСкидкуКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		
		// Создаем кнопку ПрименитьСкидку и связываем с командой ПрименитьСкидку
		ДК_ПрименитьСкидкуКнопка = Элементы.Добавить("ДК_ПрименитьСкидку", Тип("КнопкаФормы"), ДК_СкидкаГруппа);
		ДК_ПрименитьСкидкуКнопка.ИмяКоманды = "ДК_ПрименитьСкидку";
		ДК_ПрименитьСкидкуКнопка.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		
	КонецЕсли;
	// -- Вихарев А.А. 03.10.2026
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти

// ++ Вихарев А.А. 18.08.2026
#Область ОбработчикСобытийЭлементов_ДК

// Процедура обработчика событий элемента формы ДК_СогласованнаяСкидка
&НаКлиенте
Процедура ДК_СкидкаПриИзменении(Элемент)
	
	// Если обе табличные части пустые — вопрос не задаём
	Если Объект.Товары.Количество() = 0 И Объект.Услуги.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДК_СкидкаПриИзмененииЗавершение", ЭтотОбъект);
	ТекстВопроса = "Пересчитать табличную часть с учётом введённой скидки?";
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Да);
	
КонецПроцедуры // ПриИзмененииДК_СогласованнаяСидка()

&НаКлиенте
Процедура ДК_СкидкаПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ДК_ПересчитатьТабличныеЧасти();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДК_ПересчитатьТабличныеЧасти()
	
	// Табличная часть «Товары»
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл

		// Расчет суммированной скидки
		РассчитатьСуммуСтроки(СтрокаТЧ);
	КонецЦикла;
	
	// Табличная часть «Услуги»
	Для Каждого СтрокаТЧ Из Объект.Услуги Цикл
		// Расчет суммированной скидки

		РассчитатьСуммуСтроки(СтрокаТЧ);
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	// ++ Вихарев А.А. 03.10.2026
	КоэффициентСкидки = ПроверкаСуммыСкидки(ТекущиеДанные);
	ТекущиеДанные.Сумма = Окр(ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки ,2);
	// -- Вихарев А.А. 03.10.2026
	
КонецПроцедуры

// ++ Вихарев А.А. 03.10.2026
&НаКлиенте
Функция ПроверкаСуммыСкидки(ТекущиеДанные)
	
	Если (ТекущиеДанные.Скидка + Объект.ДК_СогласованнаяСкидка) < 100 Тогда
		КоэффициентСкидки = 1 - (ТекущиеДанные.Скидка + Объект.ДК_СогласованнаяСкидка)/ 100;
	Иначе 
		КоэффициентСкидки = 0;
		
	КонецЕсли;
	Возврат КоэффициентСкидки;
	
КонецФункции
// -- Вихарев А.А. 03.10.2026

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   

// ++ Вихарев А.А. 03.10.2026
// Процедура обработчика действия команды ДК_ПрименитьСкидку
&НаКлиенте
Процедура ДК_ПрименитьСкидку(Команда)
	
	ДК_ПересчитатьТабличныеЧасти();
	
КонецПроцедуры 
// -- Вихарев А.А. 03.10.2026

#КонецОбласти

#КонецОбласти